#### ⚙️ Terraform Plan for `infra/provisioning/deploy`
<details><summary>Show Plan</summary>

```

module.provisioning.data.aws_ami.debian-13: Reading...
module.provisioning.data.aws_availability_zones.available: Reading...
module.provisioning.aws_placement_group.web: Refreshing state... [id=acropolis-infra]
module.provisioning.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d428a91facf89674]
module.provisioning.data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
module.provisioning.data.aws_ami.debian-13: Read complete after 1s [id=ami-0c5d3777e994cd6cc]
module.provisioning.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0766978b11c9dc107]
module.provisioning.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-034e788daffd2ef28]
module.provisioning.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b243cfc28f60abdb]
module.provisioning.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0246c5fbd91ebd6d9]
module.provisioning.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-07b05b03791e7e181]
module.provisioning.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-095409357c65508eb]
module.provisioning.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0916972010fd760f3]
module.provisioning.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0bd9177ac6e3c6ebd]
module.provisioning.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-027c39a8aafbc8f04]
module.provisioning.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-085311e30ea223409]
module.provisioning.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0419401a8ff961675]
module.provisioning.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c3fc560fe55213fd]
module.provisioning.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-027c39a8aafbc8f041080289494]
module.provisioning.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-050faf85e5af0678f]
module.provisioning.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04cf44a7856af4e6a]
module.provisioning.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00086a55d9bfd715a]
module.provisioning.aws_security_group.instance_sg: Refreshing state... [id=sg-0e93af854bec430f9]
module.provisioning.module.ec2_instance.aws_security_group.this[0] (deposed object 38cb349c): Refreshing state... [id=sg-0a1b2205af529497d]
module.provisioning.aws_network_interface.this: Refreshing state... [id=eni-0cde20fd8a6f4eae5]
module.provisioning.module.ec2_instance.aws_iam_role.this[0]: Refreshing state... [id=acropolis-infra-20251017162554469300000005]
module.provisioning.module.ec2_instance.aws_security_group.this[0]: Refreshing state... [id=sg-0575a6cc125efc5b2]
module.provisioning.module.ec2_instance.aws_iam_instance_profile.this[0]: Refreshing state... [id=acropolis-infra-20251017162555076700000007]
module.provisioning.module.ec2_instance.aws_iam_role_policy_attachment.this["AdministratorAccess"]: Refreshing state... [id=acropolis-infra-20251017162554469300000005/arn:aws:iam::aws:policy/AdministratorAccess]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.provisioning.aws_placement_group.web has been deleted
  - resource "aws_placement_group" "web" {
      - id                 = "acropolis-infra" -> null
        name               = "acropolis-infra"
        tags               = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.provisioning.aws_placement_group.web will be created
  + resource "aws_placement_group" "web" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "acropolis-infra"
      + partition_count    = (known after apply)
      + placement_group_id = (known after apply)
      + region             = "eu-west-1"
      + spread_level       = (known after apply)
      + strategy           = "spread"
      + tags_all           = {
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
    }

  # module.provisioning.module.ec2_instance.data.aws_iam_policy_document.assume_role_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EC2AssumeRole"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Service"
            }
        }
    }

  # module.provisioning.module.ec2_instance.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.provisioning.module.ec2_instance.data.aws_subnet.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = (known after apply)
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + available_ip_address_count                     = (known after apply)
      + cidr_block                                     = (known after apply)
      + customer_owned_ipv4_pool                       = (known after apply)
      + default_for_az                                 = (known after apply)
      + enable_dns64                                   = (known after apply)
      + enable_lni_at_device_index                     = (known after apply)
      + enable_resource_name_dns_a_record_on_launch    = (known after apply)
      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      + id                                             = "subnet-095409357c65508eb"
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = (known after apply)
      + map_customer_owned_ip_on_launch                = (known after apply)
      + map_public_ip_on_launch                        = (known after apply)
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = (known after apply)
      + state                                          = (known after apply)
      + tags                                           = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.provisioning.module.ec2_instance.aws_eip.this[0] will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "eu-west-1"
      + tags                 = {
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
      + tags_all             = {
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
    }

  # module.provisioning.module.ec2_instance.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = "EC2AssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "acropolis-infra-20251017162554469300000005"
        name                  = "acropolis-infra-20251017162554469300000005"
        tags                  = {
            "account_id_secret" = "017845957019"
            "account_name"      = "aymenxsegni"
            "deployed_by"       = "aymen-segni"
            "environment"       = "test"
        }
        # (11 unchanged attributes hidden)
    }

  # module.provisioning.module.ec2_instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0c5d3777e994cd6cc"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "eu-west-1a"
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + hibernation                          = true
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "acropolis-infra-20251017162555076700000007"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "ninja-devops"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "eu-west-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-095409357c65508eb"
      + tags                                 = {
          + "Name"              = "acropolis-infra"
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
      + tags_all                             = {
          + "Name"              = "acropolis-infra"
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + credit_specification {}

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "my-root-block"
            }
          + tags_all              = (known after apply)
          + throughput            = 200
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

  # module.provisioning.module.ec2_instance.aws_security_group.this[0] must be replaced
+/- resource "aws_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:017845957019:security-group/sg-0575a6cc125efc5b2" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0575a6cc125efc5b2" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "acropolis-infra-20251017163501486300000001" -> (known after apply)
      ~ owner_id               = "017845957019" -> (known after apply)
        tags                   = {
            "Name"              = "acropolis-infra"
            "account_id_secret" = "017845957019"
            "account_name"      = "aymenxsegni"
            "deployed_by"       = "aymen-segni"
            "environment"       = "test"
        }
      ~ vpc_id                 = "vpc-0d428a91facf89674" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.provisioning.module.ec2_instance.aws_security_group.this[0] (deposed object 38cb349c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "this" {
      - arn                    = "arn:aws:ec2:eu-west-1:017845957019:security-group/sg-0a1b2205af529497d" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0a1b2205af529497d" -> null
      - ingress                = [] -> null
      - name                   = "acropolis-infra-20251017162554709000000006" -> null
      - name_prefix            = "acropolis-infra-" -> null
      - owner_id               = "017845957019" -> null
      - region                 = "eu-west-1" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"              = "acropolis-infra"
          - "account_id_secret" = "017845957019"
          - "account_name"      = "aymenxsegni"
          - "deployed_by"       = "aymen-segni"
          - "environment"       = "test"
        } -> null
      - tags_all               = {
          - "Name"              = "acropolis-infra"
          - "account_id_secret" = "017845957019"
          - "account_name"      = "aymenxsegni"
          - "deployed_by"       = "aymen-segni"
          - "environment"       = "test"
        } -> null
      - vpc_id                 = "vpc-0d428a91facf89674" -> null
    }

  # module.provisioning.module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv4_default"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all IPv4 traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "acropolis-infra-ipv4_default"
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
      + tags_all               = {
          + "Name"              = "acropolis-infra-ipv4_default"
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
    }

  # module.provisioning.module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv6_default"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "::/0"
      + description            = "Allow all IPv6 traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "acropolis-infra-ipv6_default"
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
      + tags_all               = {
          + "Name"              = "acropolis-infra-ipv6_default"
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
    }

Plan: 6 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  + instance_arn         = (known after apply)
  + instance_id          = (known after apply)
  + instance_private_dns = (known after apply)
  + instance_public_dns  = (known after apply)
  + instance_public_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pushed by: @AymenSegni, Action: `pull_request`*